{
  "title": "Опыт работы",
  "cardsContent": [
    {
      "title": "Фриланс Фронтенд Разработчик",
      "subTitle": "2022 – 2023 | Таганрог, Россия",
      "listItems": [
        "– Создавал лендинги с высокой конверсией, оптимизированные под SEO и Core Web Vitals.",
        "– Улучшал органическую видимость малых бизнесов с помощью чистого, адаптивного кода.",
        "– Разрабатывал админ-панели с drag-and-drop и обновлениями в реальном времени.",
        "– Взаимодействовал напрямую с клиентами для сбора требований и предоставления индивидуальных решений."
      ]
    },
    {
      "title": "Фронтенд Разработчик — Внутренние продукты",
      "subTitle": "2022 – 2023 | Таганрог, Россия",
      "listItems": [
        "– Разработал демо e-commerce книги с корзиной, фильтрами и роль-ориентированными представлениями.",
        "– Создал дашборд задач с React DnD, уведомлениями и анимациями Lottie.",
        "– Настроил Nx монорепозиторий и внедрил микро-фронтенды для внутреннего CRM.",
        "– Мигрировал устаревший UI на SSR с Next.js для улучшения SEO."
      ]
    },
    {
      "title": "Фронтенд Разработчик — SitterTree",
      "subTitle": "Март 2023 – настоящее время | Удаленно (международная команда)",
      "listItems": [
        "– Отвечаю за фронтенд-архитектуру U.S. платформы по подбору няни.",
        "– Нормализовал Redux state, сократив количество ошибок примерно на 30%.",
        "– Создал единый модальный компонент для 100+ сценариев.",
        "– Интегрировал Stripe, Twilio, Google Maps и роль-ориентированные дашборды.",
        "– Разработал многошаговые формы с Formik + Yup: авто-сохранение, динамическая валидация.",
        "– Улучшил UX с помощью skeleton loaders, интеллектуальной пагинации и анимаций.",
        "– Реализовал GA4 tracking и участвовал в проектировании API."
      ]
    },
    {
      "title": "Ведущий Фронтенд Разработчик — Telegram Mini App",
      "subTitle": "2024 – настоящее время | Таганрог, Россия",
      "listItems": [
        "– Разрабатываю Telegram Mini App на React, TypeScript и Tailwind CSS для e-commerce платформы табака и вейпов с более чем 4,000 товаров.",
        "– Интегрировал платёжную систему и синхронизацию складских остатков с ‘Мой Склад’.",
        "– Спроектировал адаптивный, высокопроизводительный UI, оптимизированный под Telegram WebApp.",
        "– Веду коммуникацию с клиентом, собираю требования и определяю scope проекта.",
        "– Ищу дизайнера и координирую раннюю концепцию продукта и дорожную карту."
      ]
    },
    {
      "title": "Фронтенд Разработчик — Админ Панель и Платформа Управления Продуктами",
      "subTitle": "2024 – настоящее время | Таганрог, Россия",
      "listItems": [
        "– Создаю админ-панель для управления каталогом, заказами и аналитическими дашбордами.",
        "– Реализовал CRUD для продуктов, массовые обновления и логику отслеживания заказов.",
        "– Разработал модульную React-архитектуру с переиспользуемыми компонентами и чётким разделением доменов.",
        "– Тесно сотрудничаю с клиентом по UX решениям и бизнес-логике.",
        "– Управляю приоритетами фич, обратной связью и итеративным процессом доставки."
      ]
    }
  ]
}